Repository: jiya-talreja/multi_language_detection
Catalog: backend/input/opus/en-hi.tmx
Source language: en
Languages: hi

source: There was a financial crisis in 2009.
hi: २००९ में एक वित्तीय संकट हुई थी।

source: A big crowd stood in the street.
hi: रास्ते में एक बड़ी भीड़ खड़ी थी।

source: The drug culture has its own rules.
hi: ड्रग संस्कृति के अपने ही नियम होते हैं।

source: Dance is a beautiful part of every culture.
hi: नृत्य हर एक संस्कृति का एक सुंदर भाग होता है।

source: People dress colorfully in that culture.
hi: उस संस्कृति में लोग रंग-बिरंगी कपड़े पहनते हैं।

source: They like to dance.
hi: उन्हें नाचना पसंद है।

source: What city has the most danger?
hi: किस शहर में सबसे ज़्यादा खतरा है?

source: Some people like danger.
hi: कुछ लोगों को खतरा पसंद होता है।

source: This room is too dark.
hi: इस कमरे में कुछ ज़्यादा ही अँधेरा है।

source: The national debt is growing.
hi: राष्ट्रीय ऋण बढ़ रही है।

source: What should you do to decrease your debt?
hi: अपने ऋण को कम करने के लिये क्या करना चाहिए?

source: Mary will get her degree in June.
hi: मैरी को जून में अपनी डिग्री मिलेगी।

source: An earthquake destroyed the building.
hi: एक भूकंप ने वह इमारत तबाह कर दी।

source: Children love to dig in the sand.
hi: बच्चों को रेत में खोदना अच्छा लगता है।

source: Breast cancer is a disease.
hi: स्तन कैंसर एक रोग है।

source: Tom drowned in the ocean.
hi: टॉम महासागर में डूब कर मरा।

source: That country's economy is growing.
hi: उस देश की अर्थव्यवस्था बढ़ रही है।

source: They became friends in elementary school.
hi: वे प्रारम्भिक पाठशाला में दोस्त बने।

source: Russia imported wheat from the United States.
hi: रूस ने यूनाइटेड स्टेट्‍स से गेहूँ आयात किया।

source: Lake Baikal in Russia is the deepest lake in the world.
hi: रूस में स्थित बाइकाल झील दुनिया की सबसे गहरी झील है।

source: They lived in Spain for several years.
hi: वे कई साल स्पेन में रहें।

source: A world map shows all the countries.
hi: दुनिया का नक्शा सभी देश दिखाता है।

source: Tom joined the navy after finishing college.
hi: टॉम कॉलेज की पड़ाई सम्पूर्ण करने पश्चात जल सेना में भरती हो गया ।

source: Mexico is a neighbor of the United States.
hi: मेक्सिको यूनाइटेड स्टेट्‍स का पड़ोसी है।

source: Have you ever lived in a rural area?
hi: कभी ग्रामीण क्षेत्र में रहे हो?

source: The first artificial satellite was Sputnik 1, launched by Russia in 1957.
hi: स्पुटनिक १ सबसे पहला कृत्रिम उपग्रह था, जिसे रूस मे १९५७ में प्रक्षेपित किया।

source: America is made up of 50 states.
hi: अमरीका ५० राज्यों का बना है।

source: The walls in the old house were not straight.
hi: उस पुराने घर की दीवारें सीधी नहीं थी।

source: The road stays straight for the next 50 miles.
hi: रास्ता अगले ५० मैल सीधा ही रहेगा।

source: A strange car was parked in front of my house.
hi: मेरे घर के सामने एक अजीब सी गाड़ी पार्क की गयी थी।

source: Tom's answer surprised me.
hi: टॉम के जवाब से मैं चौक गया।

source: The bridge is very long and very tall.
hi: वह पुल बहुत लंबा और बहुत ऊंचा है।

source: All Americans have to pay their taxes.
hi: सभी अमरीकीयों को अपना कर भरना पड़ता हैं।

source: The world's largest telescope is in the Canary Islands.
hi: दुनिया की सबसे बड़ी दुरबीन कैनरी द्वीप समूह पर है।

source: We saw a terrible movie last night.
hi: हमने कल रात एक भयानक फ़िल्म देखी।

source: Tom could never forget the terror of war.
hi: युद्ध का आतंक टॉम कभी नहीं भूल पाया।

source: Terrorists attacked the World Trade Center in New York City in 2001.
hi: २००१ में न्यूयॉर्क शहर में आतंकवादियों वर्ल्ड ट्रेड सेंटर पर हमला किया।

source: The forest is very thick.
hi: जंगल बहुत घना है।

source: This laptop computer is very thin.
hi: यह लैपटॉप कंप्यूटर बहुत पतला है।

source: In baseball, the pitcher is the player who throws the ball.
hi: बेसबॉल में गेंद फेंकने वाले को "पिचर" कहते है।

source: The town was established in the 18th century.
hi: यह नगर १८वे शतक में स्थापित किया गया था।

source: Trade between two countries can be complex.
hi: दो देशों के बीच का व्यापार जटिल हो सकता है।

source: They both cried after hearing the tragic news.
hi: वह दुखद ख़बर सुन कर वे दोनों रोए।

source: Does your country have nuclear weapons?
hi: क्या तुम्हारे देश के पास परमाणु हथियार हैं?

source: Software is like sex: it's better when it's free.
hi: सॉफ़्टवेयर सेक्स की तरह होता है: मुफ़्त में मिले तो बेहतर।

source: Wanker.
hi: हस्तमैथुनकर्ता.

source: Where's the bakery?
hi: बेकरी कहाँ है?

source: Where's the ice?
hi: बर्फ कहाँ है?

source: Hush!
hi: चुप!

source: Going down on somebody is an art.
hi: किसी के साथ मुख मैथुन करना एक कला होती है।

source: He has invited me to attend his wedding.
hi: उसने मुझे अपनी शादी में आने का का न्योता दिया है।

source: She has invited me to attend her wedding.
hi: उसने मुझे अपनी शादी में आने का का न्योता दिया है।

source: Idiot!
hi: मूर्ख!

source: My father is going to China.
hi: मेरे पिता चीन जा रहे हैं।

source: Fool!
hi: बेवकूफ़!

source: Ridiculous!
hi: हास्यस्पद!

source: Duh.
hi: ओफ़ फ़ो.

source: The book is white.
hi: किताब सफ़ेद है।

source: She hadn't given me her name.
hi: उसने मुझे अपना नाम नहीं दिया था।

source: I'm gay, so?
hi: मैं गे हूँ, तो?

source: See you at five.
hi: पाच बजे मिलते हैं।

source: We'd like to climb that mountain.
hi: हम उस पहाड़ के ऊपर चड़ना पसंद करेंगे.

source: It is a good cake.
hi: अच्छा केक है।

source: In a calm sea, every man is a pilot.
hi: समुंदर शांत तो हर कोई कप्तान।

source: My name is Luis.
hi: मेरा नाम लुइस है।

source: I'm Italian.
hi: मैं इतालवी हूँ।

source: I am Italian.
hi: मैं इतालवी हूँ।

source: Harry, I'm worried.
hi: हॅरी, मुझे चिंता हो रही है।

source: How many letters does the Russian alphabet have?
hi: रूसी वर्णमाला में कितने अक्षर हैं?

source: I'm not a fan of Kim Kardashian.
hi: मैं किम कार्दशियन का प्रशंसक नहीं हूं।

source: This one or that one?
hi: यह वाला या वह वाला?

source: This book isn't mine.
hi: यह किताब मेरी नहीं है।

source: The key is on the table.
hi: चाबी मेज़ पर है।

source: That's the badger!
hi: वह रहा बिज्जू!

source: It's the law.
hi: यही कानून है.

source: If you wish, you can go.
hi: अगर आप चाहो तो आप जा सकते हैं।

source: Who's the next candidate?
hi: अगला उम्मीदवार कौन है?

source: Who's that?
hi: वह कौन है?

source: This is a big house.
hi: यह एक बड़ा घर है।

source: This is a large house.
hi: यह एक बड़ा घर है।

source: Few elephants would volunteer to move to Europe.
hi: केवल कुछ ही हाथी स्वेच्छा से यूरोप को जाना पसंद करेंगे।

source: China is twenty times bigger than Japan.
hi: चीन जापान से बीस गुना बड़ा है।

source: The boy threw stones at the dog.
hi: लड़के ने कुत्ते पर पत्थर फेंके।

source: Which films are showing now?
hi: अभी कौनसी फ़िल्में दिखाई जा रहीं हैं?

source: I was born in 1988.
hi: मैं १९८८ में जन्मा था।

source: I was a teacher for fifteen years.
hi: मैं पन्द्रह साल शिक्षक था।

source: Game over.
hi: खेल ख़त्म।

source: Yeah, and?
hi: हां, तो?

source: I love my mother.
hi: मैं अपनी माँ से प्यार करता हूँ

source: I saw a red car and a white one. The red one was nicer looking than the white one.
hi: मैंने एक लाल कार और सफ़ेद कार देखि. लाल कार सफ़ेद कार से दिखने में ज्यादा अछी थी.

source: I felt bad.
hi: मुझे बुरा लगा।

source: China is a huge country.
hi: चीन एक विशाल देश है।

source: My name is Sally.
hi: मेरा नाम सैली है।

source: I am living in Volgograd.
hi: मैं वोल्गोग्रैड में रह रहा हूँ।

source: At last, the Government are listening to the people.
hi: आखिरकार, सरकार लोगों की सुन रही है।

source: I like to eat.
hi: मुझे खाना पसंद है।

source: I don't have four sisters.
hi: मेरी चार बहने नहीं है।

source: He waved at her.
hi: उसने उसकी तरफ हाथ फिराया.

source: The penis entered the vagina.
hi: लिंग ने योनी में प्रवेश किया।

source: This manga is pretty popular in China.
hi: यह मान्गा चीन में बहुत लोकप्रिय है।

source: She has big boobs.
hi: उसके बड़े मम्मे हैं।

source: She thinks about cocks all the time.
hi: वह हर वक़्त लंडों के बारे में सोचती है।

source: I am Anthony.
hi: मैं एंथनी।

source: Health is worth more than gold.
hi: आरोग्य का मूल्य सोने से ज़्यादा होता है।

source: She has large breasts.
hi: उसके पास बड़े स्तन हैं।

source: I want to sleep with your wife.
hi: मैं तुम्हारी बीवी के साथ सोना चाहता हूं।

source: My dad's name is Fritz.
hi: मेरे पापा का नाम फ्रित्ज़ है।

source: Open Sesame!
hi: खुल जा सिमसिम!

source: This writer is Russian.
hi: यह लेखक रूसी है।

source: My friend is Indian.
hi: मेरा दोस्त भारतीय है।

source: Fry.
hi: तलना.

source: The Okonomiyaki was very delicious.
hi: ओकोनोमियाकी बहुत स्वादिष्ट था।

source: I don't understand Chinese, but I want to learn.
hi: मैं चीनी नहीं समझता, मगर सीखना चाहता हूं।

source: Yesterday I became a god, but found that a bit boring, so today I became a devil.
hi: कल मैं देवता बना, लेकिन इसमें मुझे मज़ा नहीं आया। इसलिए आज मैं शैतान बन गया।

source: Do you want to have sex with me tonight?
hi: क्या तुम आज रात मेरे साथ सेक्स करना चाहते हो?

source: What is the capital of Haiti?
hi: हैती की राजधानी क्या है?

source: The book is red.
hi: पुस्तक लाल है।

source: I am afraid of death.
hi: मैं मौत से डरता हूँ।

source: They were so different.
hi: वे कितने अलग थे।

source: They accepted the new government.
hi: उन्होंने नया सरकार स्वीकारा।

source: They said Anderson and his men must leave the fort.
hi: उन्होंने कहां के अॅन्डर्सन और उसके आदमियों को गढ़ छोड़ना पड़ेगा।

source: He was a Roman Catholic.
hi: वह रोमन कैथोलिक था।

source: He spoke to farmers in Iowa.
hi: उसने आयोवा में किसानों से बात की।

source: He was aiming a gun at them.
hi: उसने बंदूक से उन पर निशाना साधा था।

source: He was caught in the middle.
hi: वह बीच में अटका था।

source: He did not like responsibility.
hi: उसे जिम्मेदारी पसंद नहीं थी।

source: He was living with the Indians.
hi: वह उन भारतीयों के साथ रह रहा था।

source: He crossed the Rio Grande River.
hi: उसने रिओ ग्रांडे नदी पार की।

source: He was the king of rock-and-roll.
hi: वह रॉक अॅन्ड रोल का राजा था।

source: He was a member of the Supreme Court.
hi: वह सर्वोच्च न्यायालय का सदस्य था।

source: He was a member of the Republican Party.
hi: वे रिपब्लिकन पार्टी के सदस्य थे।

source: The British soldiers rested.
hi: ब्रिटेनी सैनिकों ने आराम किया।

source: The people of Boston hated the British soldiers.
hi: बॉस्टन के लोग ब्रिटिश सैनिकों से नफ़रत करते थें।

source: Finally, on January eighth, the British attacked.
hi: आखिर, आठ जनवरी को, ब्रिटिशों ने हमला किया।

source: General Montcalm attacked several British forts in 1757.
hi: सेनापति मोन्टकाम ने १७५७ में अनेक ब्रिटिश गढ़ों पर हमला किया।

source: The British defeated the French in North America in 1763.
hi: ब्रिटिशों ने १७६३ में फ़्रांसीसीयों को हराया।

source: The British believed the Americans were violating their law.
hi: ब्रिटिशों का मानना था के अमरीकी उनके कानूनों का उल्लंघन कर रहे थे।

source: Italy, Romania, Portugal, and Greece joined the Allies.
hi: इटली, रोमानिया, पुर्तगाल और यूनान मित्र-राष्ट्रों में शामिल हो गये।

source: The Cold War began after World War Two.
hi: शीतयुद्ध द्वितीय विश्वयुद्ध के बाद शुरू हुआ।

source: Japan had defeated Russia in a war in 1905.
hi: १९०५ में जापान ने रूस को एक युद्ध में हराया था।

source: Germany wanted Russia to stay out of the war.
hi: जर्मनी चाहता था कि रूस युद्ध से बाहर रहे।

source: Germany and Japan were defeated.
hi: जर्मनी और जापान पराजित हो गये।

source: Two Indians were killed.
hi: दो भारतीय मारे गये।

source: Only two Texans were killed.
hi: केवल दो टेक्सन मारे गये।

source: Thirty-thousand people were killed.
hi: तीस हजार लोग मारे गये।

source: Two thousand American soldiers were killed.
hi: दो हज़ार अमरीकी सैनिक मारे गये।

source: About four thousand soldiers were killed.
hi: लगभग चार हज़ार सैनिक मारे गये।

source: The soldiers had more powerful weapons.
hi: सैनिकों के पास अधिक ताकतवर हथियार थे।

source: There was enough food for forty days.
hi: चालीस दिनों के लिये काफ़ी भोजन था।

source: Saddam rejected the demand.
hi: सद्दाम ने मांग को अस्वीकार किया।

source: Many farmers lost their farms.
hi: कई किसान अपने खेत गवां बैठे।

source: Spain ruled Cuba at that time.
hi: उस वक़्त क्यूबा पर स्पेन राज करता था।

source: Warren Harding was an honest man.
hi: वॉरेन हार्डिंग ईमानदार आदमी था।

source: John Kennedy was just forty-three.
hi: जॉन केनडी केवल तैंतालीस साल के थे।

source: Taft did not want to be president.
hi: टाफ़्ट राष्ट्रपति नहीं बनना चाहते थे।

source: In August 1990, Iraq invaded Kuwait.
hi: अगस्त १९९० में इराक ने कुवैत पर आक्रमण किया।

source: More than five-hundred were wounded.
hi: पाँच सौ से ज़्यादा ज़ख्मी थे।

source: A week later, Germany attacked Poland.
hi: एक हफ़्ते बाद जर्मनी ने पोलैंड पर आक्रमण किया।

source: One of Hamilton's friends explained the rules.
hi: हॅमिल्टन के दोस्तों में से एक ने नियम समझाएं।

source: My birthday approaches.
hi: मेरा जन्मदिन पास आ रहा है।

source: No doubt.
hi: कोई शक नहीं।

source: This sentence has only one language.
hi: इस वाक्य की बस एक भाषा है।

source: What happened then?
hi: उसके बाद क्या हुआ?

source: This tea tastes good.
hi: इस चाय का स्वाद अच्छा है।

source: My grandfather was a farmer.
hi: मेरे दादा किसान थे।

source: You tell him the truth.
hi: उसे सच बताओ।

source: The black one is mine.
hi: काला वाला मेरा है।

source: English is a common language for many Asians.
hi: अंग्रेज़ी कईं एशियाइयों के लिए सामान्य भाषा है।

source: Gotcha!
hi: पकड़ लिया!

source: I don't like teachers who like students who don't like asking questions.
hi: सवाल पूछना न पसंद करने वाले विद्यार्थियों को पसंद करने वाले शिक्षक मुझे पसंद नहीं।

source: We've been here for a couple of minutes.
hi: हमें यहाँ आये हुए केवल दो मिनट ही हुए हैं.

source: I had naan with the tea for breakfast.
hi: मैने सुबह के नाश्ते में चाय के साथ नान ली।

source: China is the biggest country in Asia.
hi: एशिया में सबसे बड़ा देश चीन है।

source: I ate three pieces of cake.
hi: मैंने केक के तीन टुकड़े खाए.

source: He arrives unannounced.
hi: वह बिना बताये आता है।

source: Incredible!
hi: अनूठा!

source: Real men drink tea.
hi: असली मर्द चाय पीते हैं।

source: Not long ago we heard a father say in the presence of his large family, "I don't want any of my boys to be lawyers."
hi: हाल ही में हमने एक पिता को यह बोलते सुना कि उसका कोई भी लड़का बड़ा होके वकील नहीं बनेगा.

source: Do you watch "Tom and Jerry"?
hi: "टॉम एंड जेरी" देखते हो?

source: We don't have tea.
hi: हमारे पास चाय नहीं है।

source: He came.
hi: वह आया।

source: Two years ago I went to China.
hi: दो साल पहले मैं चीन गया।

source: Looking at your Facebook friends' photos is a waste of time.
hi: फ़ेसबुक पर अपने दोस्तों की तसवीरें देखते बैठना मतलब वक़्त की बरबादी है।

source: English is also studied in China.
hi: अंग्रेज़ी भी चीन में पढ़ी जाती है।

source: I saw my grandfather last week.
hi: मैने मेरे दादा को पिछले हफ़्ते देखा।

source: Alas.
hi: हाय.

source: I saw you in the strip club the day before yesterday.
hi: मैंने तुम्हें परसों स्ट्रिप क्लब में देखा था।

source: Her boyfriend is an idiot.
hi: उसका बॉयफ़्रेंड बेवकूफ़ है।

source: His boyfriend is an idiot.
hi: उसका बॉयफ़्रेंड बेवकूफ़ है।

source: Where were we?
hi: हम कहां थे?

source: Iran is the eighteenth largest country in the world.
hi: ईरान दुनिया का अठारहवाँ सबसे बड़ा देश है।

source: Where's Daddy?
hi: पापा कहाँ हैं?

source: Kate Middleton is now the duchess of Cambridge.
hi: केट मिडलटन अभी केंब्रिज की डचेस हैं।

source: Lucy is an American.
hi: लूसी अमरीकी है।

source: This week, we're in a hurry.
hi: इस हफ़्ते हम जलदी में हैं।

source: Interesting.
hi: दिलचस्प.

source: China is a large country.
hi: चीन बड़ा देश है।

source: China is a great country.
hi: चीन महान देश है।

source: You’ll fall!
hi: गिर जाओगे!

source: Spanish is easy.
hi: स्पेनी आसान है।

source: Cairo is the biggest city in Africa.
hi: काहिरो आफ़्रिका का सबसे बड़ा शहर है।

source: Err...
hi: अरे...

source: Nope.
hi: नही.

source: You will speak Swedish.
hi: तुम स्वीडिश में बोलोगे।

source: What kind of bird is this?
hi: यह किस प्रकार का पक्षी है?

source: He will have to do that task again.
hi: उसे वो काम फिर से करना पड़ेगा ।

source: We are going to meet him tonight.
hi: हम आज रात उसको मिलेंगे.

source: She sent those e-mails an hour ago.
hi: उसने वे पपत्र एक घंटे पहले भेजे।

source: What were you doing at 9 o'clock last night?
hi: तुम कल रात ९ बजे क्या कर रहे थे?

source: This car is black.
hi: यह गाड़ी काली है।

source: She and I are Brazilian.
hi: वह और मैं ब्राज़ीली हैं।

source: Jack and Bill were very good friends.
hi: जैक व बिल घनिष्ठ मित्र थे।

source: Choose one.
hi: एक चुनो।

source: We're sharing your work.
hi: हम तुम्हारा काम बाँट रहें हैं।

source: When is the Apocalypse?
hi: क़यामत कब है?

source: Remember!
hi: याद रखो!

source: She didn't want him to go overseas.
hi: वह लड़की नहीं चाहती थी कि वह लड़का विदेश जाए।

source: She handed him his jacket then opened the door and asked him to leave.
hi: मैनें उसे उसका जैकेट हात में दे दिया, फिर दरवाज़ा खोला और उसे चले जाने के लिए कहां।

source: She helps him.
hi: वह उसकी मदत करती है।

source: She is helping him.
hi: वह उसकी मदत कर रही है।

source: She slapped him.
hi: उसने उसे थप्पड़ मारी।

source: Sure!
hi: ज़रूर!

source: Come!
hi: आओ!

source: I've got a boner.
hi: मेरा खड़ा है।

source: We all speak English.
hi: हम सब अंग्रेज़ी बोलते हैं।

source: Vladivostok is a city in Russia.
hi: व्लोदिवोस्तोक रूस में एक शहर है।

source: I understand your language.
hi: आपकी भाषा मुझे समझ आती है।

source: Get up.
hi: उठ।

source: Japanese are Asians.
hi: जापानी एशियाई हैं।

source: There are fifty stars on the American flag.
hi: अमेरिकी झंडे पर पचास सितारें हैं।

source: The major religions in China are Taoism, Buddhism, Islam and Christianity.
hi: चीन में प्रमुख धर्म है ताओ धर्म, बुद्ध धर्म, इस्लाम और ईसाई धर्म।

source: Run!
hi: भाग!

source: What's your favorite castle in Japan?
hi: जापान में आपका सबसे पसंदीदा किला कौनसा है?

source: What's your favorite domestic wine?
hi: तुम्हारी पसंदीदा देशी वाइन कौन सी है?

source: What's your favorite non-Google search engine?
hi: गूगल के अलावा आपका सबसे पसंदीदा सर्च इंजन कौनसा है?

source: What's your favorite font?
hi: तुम्हारा पसंदीदा फॉन्ट कौनसा है?

source: Someone came.
hi: कोई आया।

source: She left with her friends.
hi: वह अपने दोस्तों के साथ चली गई।

source: Who's your favorite American actor?
hi: तुम्हारा सबसे पसंदीदा अमरीकी अभिनेता कौन है?

source: Who's your favorite character on Glee?
hi: ग्ली में तुम्हारा सबसे पसंदीदा किरदार कौनसा है?

source: Keep listening.
hi: सुनते रहो।

source: Darcy said nothing at all.
hi: डार्सी ने तो कुछ भी नहीं कहा।

source: Poland is a big country.
hi: पोलैंड एक बड़ा देश है।

source: Impossible.
hi: नामुमकिन।

source: Its working properly here but not up there.
hi: यह यहाँ तो ठीक चल रहा है पर वहाँ ऊपर नहीं।

source: Portugal has only one neighbor and it's Spain.
hi: पुर्त्तगाल का बस एक ही पड़ोसी है, और वह हे स्पेन।

source: The woman is naked.
hi: वह औरत नंगी है।

source: I was forced to work on Sunday.
hi: मुझसे रविवार को जबरदस्ती कम कराया गया था |

source: My brother has never lost at tennis.
hi: मेरा भाई टेनिस मैं कभी नहीं हारा है।

source: He is now old enough to travel by himself.
hi: उसकी अकेले सफ़र करने की उम्र हो गयी है।

source: I've drunk my cup of tea.
hi: मैंने अपनी एक कप चाय पि ली है।

source: Many young Romans went to Greece.
hi: कई जवान रोमन यूनान गएं।

source: Hooray!
hi: वाह!

source: I remember this word.
hi: मुझे यह शब्द स्मरण है ।

source: Italy is in Europe.
hi: इटली युरोप में है।

source: This is my email address.
hi: यह मेरा ई - मेल एड्रेस है.

source: Maja Keuc is a good singer.
hi: माया केउत्स अच्छी गायिका है।

source: I know quite a few people who don't eat meat.
hi: मैं ऐसे कई लोगों को जानता हूं जो मांस नहीं खाते।

source: It's dangerous to play with fire.
hi: आग से खेलना खतरनाक होता है।

source: They ate turkey on Thanksgiving Day.
hi: उन्होंने थैंक्सगिविंग दिवस पर टर्की खाया।

source: Vegetarians eat vegetables.
hi: शाकाहारी लोग सब्ज़ीयाँ खाते हैं।

source: Why didn't she tell me?
hi: उसने मुझे क्यों नहीं बताया?

source: Why do children lie to their parents?
hi: बच्चे अपने माता-पिता से झूठ क्यों बोलते हैं?

source: Why do people not always tell the truth?
hi: लोग हमेशा सच क्यों नहीं कहते?

source: You look Japanese.
hi: तुम जापानी दिखते हो।

source: Trust me.
hi: मुझ पर विश्वास करो।

source: The man is naked.
hi: वह आदमी नंगा है।

source: The madness has yet to begin.
hi: पिकचर अभी बाकी है।

source: She needs this.
hi: उसे इसकी ज़रूरत है।

source: Where's the nearest metro station?
hi: सबसे पास का मेट्रो स्टेशन कहां है?

source: John is at the airport.
hi: जॉन एअरपोर्ट पर है.

source: I wanted to go to China.
hi: मैं चीन जाना चाहता था।

source: Is everything ready?
hi: सब कुछ तैयार है?

source: Please do not write in this library book.
hi: कृपया पुस्तकालय के किताबों में कुछ न लिखे

source: First France, then Iraq.
hi: पहले फ़्रांस, फिर इराक।

source: What have I done?
hi: यह मैंने क्या किया?

source: That's the law.
hi: यही कानून है।

source: Nonsense.
hi: बकवास।

source: I am learning Japanese.
hi: मैं जापानी सिख रहा हूँ|

source: He who starts ten tasks won't finish a single one.
hi: जो दस काम शुरू करता है वह एक भी खत्म नहीं करेगा।

source: Are you alright?
hi: तुम ठीक हो?

source: Champagne, please.
hi: शैंपेन, कृप्या।

source: The capital of the United Kingdom is London.
hi: संयुक्त राज्य की राजधानी लंदन है।

source: I'm in Portugal.
hi: मैं पुर्तगाल में हूँ।

source: What's the plan?
hi: प्लान क्या है?

source: There wasn't anybody in that room.
hi: कमरे में कोई भी नहीं था।

source: I don't like to drink coffee.
hi: मुझे कॉफ़ी पीना पसंद नहीं।

source: Are they live?
hi: क्या वे ज़िंदा हैं?

source: That is my book.
hi: वह मेरी किताब है।

source: I drink coffee.
hi: मैं कॉफ़ी पीता हूँ।

source: I'm reading this book.
hi: मैं यह पुस्तक पढ़ रहा हूँ।

source: Not a single person had arrived late.
hi: एक भी व्यक्ति देर से नहीं पहुँचा था।

source: That train is going to Niigata.
hi: वह रेलगाड़ी नीगाता जा रही है।

source: I'm taking my book with me.
hi: मैं यह किताब मेरे साथ ले जा रहा हूँ।

source: He came to London to study English.
hi: वह अंग्रेज़ी की पढ़ाई लंदन आया।

source: Everybody lies.
hi: सारे लोग झूठ बोलते हैं।

source: Let's meet at five.
hi: पाँच बजे मिलते हैं।

source: The children built a sand castle on the beach.
hi: बच्चों ने बीच पर रेत का किला बनाया।

source: Strange.
hi: अजीब बात है।

source: Helsinki is the capital of Finland.
hi: हेलसिंकी फ़िनलैंड की राजधानी है।

source: So?
hi: तो?

source: I'm not afraid of anything.
hi: मुझे किसी भी चीज़ से डर नहीं लगता।

source: I'm gay.
hi: मैं गे हूँ।

source: What does Tom do?
hi: टॉम क्या करता है।

source: Tom works from nine to five.
hi: टॉम नौ से पाँच बजे तक काम करता है।

source: Tom talked about his family.
hi: टॉम ने अपने परिवार के बारे में बात की।

source: Tom takes a bath at least three times a week.
hi: टॉम हफ्ते में कम से कम तीन बार नहाता है।

source: Tom made a mistake.
hi: टॉम ने एक गलती की।

source: Tom likes listening to the radio when he's driving.
hi: टॉम गाड़ी चलाते वक्त रेडियो सुनना पसंद करता है।

source: Tom likes coffee better than tea.
hi: टॉम को चाय से ज़्यादा कॉफ़ी पसंद है।

source: Tom let out a deep breath.
hi: टॉम ने एक गहरी सांस छोड़ी।

source: Tom isn't able to drive yet.
hi: टॉम अभी गाड़ी नहीं चला सकता।

source: Tom is very hardworking.
hi: टॉम बहुत ही मेहनती है।

source: Tom is poor.
hi: टॉम गरीब है।

source: Tom is on duty now.
hi: टॉम अभी ड्यूटी पर है।

source: Tom is leaving for India next Friday.
hi: टॉम अगले शुक्रवार भारत के लिए रवाना हो रहा है।

source: Tom is in need of help.
hi: टॉम को मदद की ज़रूरत है।

source: Tom is in his office.
hi: टॉम अपने दफ़्तर में है।

source: Tom hasn't cleaned the kitchen yet.
hi: टॉम ने अभी तक रसोई साफ़ नहीं की है।

source: Tom has two sons. Both of them live in Boston.
hi: टॉम के दो बेटे हैं। दोनों बॉस्टन में रहते हैं।

source: Tom has been living in Boston for almost ten years.
hi: टॉम बॉस्टन में लगभग दस सालों से रह रहा है।

source: Tom has accumulated a lot of junk.
hi: टॉम ने बहुत सारा कबाड़ इकट्ठा किया है।

source: Tom has a nice camera.
hi: टॉम के पास एक अच्छा सा कैमेरा है।

source: Tom had fifty dollars in his pocket at the time.
hi: टॉम की जेब में उस समय पचास डॉलर थें।
